In [2]:
import pandas as pd
pd.__version__

'1.3.4'

In [3]:
data = {'name': ['Joe', 'Mike', 'Jack', 'Rose', 'David', 'Marry', 'Wansi', 'Sidy', 'Jason', 'Even'],
        'age': [25, 32, 18, np.nan, 15, 20, 41, np.nan, 37, 32],
        'gender': [1, 0, 1, 1, 0, 1, 0, 0, 1, 0],
        'isMarried': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df.head()

    name   age  gender isMarried
a    Joe  25.0       1       yes
b   Mike  32.0       0       yes
c   Jack  18.0       1        no
d   Rose   NaN       1       yes
e  David  15.0       0        no

# df[]

df 默认索引是0、1、......，也可自定义索引

df[index] index若在行内则取行、index在列内则取列，体现了多态的思想

优先取行

In [ ]:
df[0:2]#【）
df['a':'b']#【】
# 布尔数组这里，长度若与行同 则选取行，与列同选取列
df[[True,True,True,False,False,False,False,False,False,False]]
df[[each>30 for each in df['age']]]
df[df['age']>30]
df[
    (df['age']>30)&
    (df['gender']==0)
]

df['name'] # return series
df[['name']]# return dataframe 注意与上的区别
df[lambda df:df.columns[0]]#Callable对象 还不太明白

## 选取行

### 默认索引

默认索引[a,b)左闭右开

In [10]:
df[0:2]

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes

In [14]:
df[0:10:2]

    name   age  gender isMarried
a    Joe  25.0       1       yes
c   Jack  18.0       1        no
e  David  15.0       0        no
g  Wansi  41.0       0        no
i  Jason  37.0       1        no

### 自定义索引

自定义索引[a,b]左闭右闭

In [13]:
df['a':'b']

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes

In [15]:
df['a':'g':2]

    name   age  gender isMarried
a    Joe  25.0       1       yes
c   Jack  18.0       1        no
e  David  15.0       0        no
g  Wansi  41.0       0        no

### 布尔数组

选取前3个

In [16]:
df[[True,True,True,False,False,False,False,False,False,False]]

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes
c  Jack  18.0       1        no

In [17]:
df[[each>30 for each in df['age']]]

    name   age  gender isMarried
b   Mike  32.0       0       yes
g  Wansi  41.0       0        no
i  Jason  37.0       1        no
j   Even  32.0       0        no

In [18]:
df[df['age']>30]

    name   age  gender isMarried
b   Mike  32.0       0       yes
g  Wansi  41.0       0        no
i  Jason  37.0       1        no
j   Even  32.0       0        no

In [20]:
df[
    (df['age']>30)&
    (df['gender']==0)
]

    name   age  gender isMarried
b   Mike  32.0       0       yes
g  Wansi  41.0       0        no
j   Even  32.0       0        no

## 选取列

列选取方式也有三种：标签索引、标签列表、Callable对象

### 标签索引

In [21]:
df['name']

a      Joe
b     Mike
c     Jack
d     Rose
e    David
f    Marry
g    Wansi
h     Sidy
i    Jason
j     Even
Name: name, dtype: object

In [23]:
df[['name']]

    name
a    Joe
b   Mike
c   Jack
d   Rose
e  David
f  Marry
g  Wansi
h   Sidy
i  Jason
j   Even

In [22]:
df[['name','age']]

    name   age
a    Joe  25.0
b   Mike  32.0
c   Jack  18.0
d   Rose   NaN
e  David  15.0
f  Marry  20.0
g  Wansi  41.0
h   Sidy   NaN
i  Jason  37.0
j   Even  32.0

### Callable对象

In [24]:
df[lambda df:df.columns[0]]

a      Joe
b     Mike
c     Jack
d     Rose
e    David
f    Marry
g    Wansi
h     Sidy
i    Jason
j     Even
Name: name, dtype: object

## 补充

In [6]:
df[~(df['age']==20)]#取反
df[df['name'].str.contains('e')]#若筛选特征有NAN会报错，解决方法如下两种
df[df.address.str.contains('深圳',na=False)]
df[df.address.str.contains('深圳')==True]

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes
d  Rose   NaN       1       yes
j  Even  32.0       0        no

# 区域索引

　可以通过df.loc[]，df.iloc[]，df.ix[]三种方法实现。
 
 方括号内必须有两个参数，第一个参数是对行的筛选条件，第二个参数是对列的筛选条件，两个参数用逗号隔开。df.loc[]，df.iloc[]，df.ix[]的区别如下：

　　df.loc[]只能使用标签索引，不能使用整数索引，通过便签索引切边进行筛选时，前闭后闭。

　　df.iloc[]只能使用整数索引，不能使用标签索引，通过整数索引切边进行筛选时，前闭后开。；

　　df.ix[]既可以使用标签索引，也可以使用整数索引。

## df.loc[]

df.loc[对行操作:对列操作] 对行对列的操作与df[]类似

### 对行进行操作

In [28]:
df.loc[['a','c'],:]

   name   age  gender isMarried
a   Joe  25.0       1       yes
c  Jack  18.0       1        no

In [25]:
df.loc['a':'d',:]

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes
c  Jack  18.0       1        no
d  Rose   NaN       1       yes

In [26]:
df.loc[df['age']>30,:]

    name   age  gender isMarried
b   Mike  32.0       0       yes
g  Wansi  41.0       0        no
i  Jason  37.0       1        no
j   Even  32.0       0        no

In [27]:
df.loc[lambda df:df['age']>30,:]

    name   age  gender isMarried
b   Mike  32.0       0       yes
g  Wansi  41.0       0        no
i  Jason  37.0       1        no
j   Even  32.0       0        no

### 对列进行操作

In [32]:
df.loc[:,['name','gender']]

    name  gender
a    Joe       1
b   Mike       0
c   Jack       1
d   Rose       1
e  David       0
f  Marry       1
g  Wansi       0
h   Sidy       0
i  Jason       1
j   Even       0

In [31]:
df.loc[:,'name':'gender']

    name   age  gender
a    Joe  25.0       1
b   Mike  32.0       0
c   Jack  18.0       1
d   Rose   NaN       1
e  David  15.0       0
f  Marry  20.0       1
g  Wansi  41.0       0
h   Sidy   NaN       0
i  Jason  37.0       1
j   Even  32.0       0

In [35]:
df.loc[:,[True,True,True,False]]

    name   age  gender
a    Joe  25.0       1
b   Mike  32.0       0
c   Jack  18.0       1
d   Rose   NaN       1
e  David  15.0       0
f  Marry  20.0       1
g  Wansi  41.0       0
h   Sidy   NaN       0
i  Jason  37.0       1
j   Even  32.0       0

### 行列进行索引

In [37]:
df.loc[df['gender']==0,['age']]

    name
b   Mike
e  David
g  Wansi
h   Sidy
j   Even

## df.iloc[]

### 选取行

In [43]:
df.iloc[1:3:]

   name   age  gender isMarried
b  Mike  32.0       0       yes
c  Jack  18.0       1        no

In [46]:
df.iloc[[1,3,5],:]

    name   age  gender isMarried
b   Mike  32.0       0       yes
d   Rose   NaN       1       yes
f  Marry  20.0       1        no

In [49]:
df.iloc[[True,True,True,False,False,False,False,False,False,False],:]

   name   age  gender isMarried
a   Joe  25.0       1       yes
b  Mike  32.0       0       yes
c  Jack  18.0       1        no

### 选取列

In [56]:
df.iloc[:,[0,3]]

    name isMarried
a    Joe       yes
b   Mike       yes
c   Jack        no
d   Rose       yes
e  David        no
f  Marry        no
g  Wansi        no
h   Sidy       yes
i  Jason        no
j   Even        no

In [55]:
df.iloc[:,0:3]

    name   age  gender
a    Joe  25.0       1
b   Mike  32.0       0
c   Jack  18.0       1
d   Rose   NaN       1
e  David  15.0       0
f  Marry  20.0       1
g  Wansi  41.0       0
h   Sidy   NaN       0
i  Jason  37.0       1
j   Even  32.0       0

In [57]:
df.iloc[:,[True,True,True,False]]

    name   age  gender
a    Joe  25.0       1
b   Mike  32.0       0
c   Jack  18.0       1
d   Rose   NaN       1
e  David  15.0       0
f  Marry  20.0       1
g  Wansi  41.0       0
h   Sidy   NaN       0
i  Jason  37.0       1
j   Even  32.0       0

## 总结

返回是 单列或单行，则返回Series对象

返回是 多行多列，则返回DataFrame对象

返回一个单元格，则返回基本数据类型

参考：https://www.cnblogs.com/chenhuabin/p/10485549.html

# any() all()

```PYTHON
df.any(axis=0, bool_only=None, skipna=True, level=None, **kwargs)

df.all(axis=0, bool_only=None, skipna=True, level=None, **kwargs)


```

In [ ]:
df.all()